src/cf/ChartsOfCharacteristicTypes/ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ПредопределенныеЗначения</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПредопределенныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияЭлементов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПредопределенныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/ПредопределенныеЗначения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
// 
// Возвращаемое значение:
//  ПроизвольныйТип - Значение переменной ПВХ.
// 
Функция ПолучитьЗначение(Имя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Значение = Неопределено;
	
	Если ПланыВидовХарактеристик.ПредопределенныеЗначения[Имя].СписокЗначений Тогда
		Значение = ОбщегоНазначения.ВыгрузитьКолонку(
			ПланыВидовХарактеристик.ПредопределенныеЗначения[Имя].ЗначенияЭлементов, "Значение", Истина);
	ИначеЕсли ПланыВидовХарактеристик.ПредопределенныеЗначения[Имя].Пароль Тогда
		Значение = ПолучитьПарольПоИмени(Имя);
	Иначе
		Значение = ПланыВидовХарактеристик.ПредопределенныеЗначения[Имя].Значение;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Значение;
	
КонецФункции

// Возвращает соответствие предопределенных элементов ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имена переменных ПВХ, перечисленные через запятую.
//  ВРазрезеКлючей - Булево - Признак получения данных в виде соответствия, где Ключ - Имя переменной.
// 
// Возвращаемое значение:
//  - Соответствие - Соответствие имен и значений переменных ПВХ.
//  - Массив - Массив значений переменных ПВХ.
// 
Функция ПолучитьЗначения(Имена, ВРазрезеКлючей = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВРазрезеКлючей Тогда
		Значения = Новый Соответствие;
	Иначе
		Значения = Новый Массив;
	КонецЕсли;
	
	МассивИмен = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Имена);
	МассивИмен = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивИмен);
	
	Если Не МассивИмен.Количество() Тогда
		Возврат Значения;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ПредопределенныеЗначения.Ссылка КАК ПредопределенноеЗначение,
		|	ПредопределенныеЗначения.ИмяПредопределенныхДанных КАК Имя
		|ПОМЕСТИТЬ ПредопределенныеЗначения
		|ИЗ
		|	ПланВидовХарактеристик.ПредопределенныеЗначения КАК ПредопределенныеЗначения
		|ГДЕ
		|	ПредопределенныеЗначения.ИмяПредопределенныхДанных В(&МассивИмен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредопределенныеЗначения.Имя КАК Имя,
		|	ПредопределенныеЗначения1.Значение КАК Значение,
		|	ПУСТАЯТАБЛИЦА.( КАК Значение) КАК ЗначенияЭлементов,
		|	ПредопределенныеЗначения1.Пароль КАК Пароль,
		|	ЛОЖЬ КАК СписокЗначений
		|ИЗ
		|	ПредопределенныеЗначения КАК ПредопределенныеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ПредопределенныеЗначения КАК ПредопределенныеЗначения1
		|		ПО ПредопределенныеЗначения.ПредопределенноеЗначение = ПредопределенныеЗначения1.Ссылка
		|			И (НЕ ПредопределенныеЗначения1.СписокЗначений)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПредопределенныеЗначения.Имя,
		|	НЕОПРЕДЕЛЕНО,
		|	ПредопределенныеЗначения1.ЗначенияЭлементов.(
		|		Значение
		|	),
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	ПредопределенныеЗначения КАК ПредопределенныеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ПредопределенныеЗначения КАК ПредопределенныеЗначения1
		|		ПО ПредопределенныеЗначения.ПредопределенноеЗначение = ПредопределенныеЗначения1.Ссылка
		|			И (ПредопределенныеЗначения1.СписокЗначений)";
	
	Запрос.УстановитьПараметр("МассивИмен", МассивИмен);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Значение = Неопределено;
		
		Если Выборка.Пароль Тогда
			Значение = ПолучитьПарольПоИмени(Выборка.Имя);
		ИначеЕсли Выборка.СписокЗначений Тогда
			Значение = ОбщегоНазначения.ВыгрузитьКолонку(Выборка.ЗначенияЭлементов.Выгрузить(), "Значение", Истина);
		Иначе
			Значение = Выборка.Значение;
		КонецЕсли;
		
		Если ВРазрезеКлючей Тогда
			Значения.Вставить(Выборка.Имя, Значение);
		Иначе
			Если ТипЗнч(Значение) = Тип("Массив") Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Значения, Значение);
			Иначе
				Значения.Добавить(Значение);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ВРазрезеКлючей Тогда
		Значения = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Значения);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Значения;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПарольПоИмени(Имя)
	
	Значение = Неопределено;
	
	ДанныеХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			Строка(ПланыВидовХарактеристик.ПредопределенныеЗначения[Имя].УникальныйИдентификатор()));
		
	Если ТипЗнч(ДанныеХранилища) = Тип("Структура") Тогда
		Значение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеХранилища, "bit_password", "");
	Иначе
		Значение = "";
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
